app/controllers/admin/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "admin" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["admin", true], ["password_digest", "$2a$12$pHXSV0bLT51mALKX9CrmSuF2P29ZQ/tQBGvw/84mnx0U1yx/4foKa"], ["updated_at", "2019-08-27 17:41:26.726830"], ["id", 5]]