app/views/tasks/_form.html.slim

    = f.label :label_ids
    = f.collection_check_boxes :label_ids, Label.all ,:id, :name
---
SELECT "labels".* FROM "labels"