app/views/tasks/show.html.slim

SELECT "labels".* FROM "labels" INNER JOIN "labellings" ON "labels"."id" = "labellings"."label_id" WHERE "labellings"."task_id" = $1  [["task_id", 121]]
---
      td
       - @task.labels.each do |label|