app/controllers/tasks_controller.rb

  def index
    @tasks = current_user.tasks

    search_word = params[:word].presence
    @tasks = @tasks.where("name LIKE ?","%#{search_word}") if search_word
    if params[:status].present?
      @tasks = @tasks.where(status: params[:status])
    else
      @tasks = @tasks.all
    end

    case params[:order]
      when 'limit'
        @tasks = @tasks.order(limit: :desc)
      when 'created_at'
        @tasks = @tasks.order(create_at: :desc)
      when 'status'
        @tasks = @tasks.order(status: :desc)
      when 'priority'
        @tasks = @tasks.order(priority: :asc)
    end

    @tasks = @tasks.order(created_at: :desc).page(params[:page])
---
SELECT "tasks".* FROM "tasks" WHERE (name LIKE '%task') ORDER BY "tasks"."created_at" DESC
SELECT "tasks".* FROM "tasks" WHERE (name LIKE '%タスク') AND "tasks"."status" = $1 ORDER BY "tasks"."created_at" DESC  [["status", "0"]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 13], ["id", 121], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND (name LIKE '%タスク') AND "tasks"."status" = $2 LIMIT $3 OFFSET $4  [["user_id", 13], ["status", "1"], ["LIMIT", 25], ["OFFSET", 0]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY "tasks"."priority" ASC, "tasks"."created_at" DESC LIMIT $2 OFFSET $3  [["user_id", 5], ["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "tasks" WHERE "tasks"."user_id" = $1 AND (name LIKE '%タスク') AND "tasks"."status" = $2 LIMIT $3 OFFSET $4) subquery_for_count  [["user_id", 13], ["status", "1"], ["LIMIT", 25], ["OFFSET", 0]]

  def show
    @task = current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 13], ["id", 121], ["LIMIT", 1]]

  def create
    @task = current_user.tasks.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "limit", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "task"], ["description", "description"], ["created_at", "2019-08-16 20:09:17.184120"], ["updated_at", "2019-08-16 20:09:17.184120"], ["limit", "2019-08-16"], ["user_id", 3]]

  def edit
    @task = current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 13], ["id", 121], ["LIMIT", 1]]

  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "tasks" SET "priority" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["priority", 1], ["updated_at", "2019-08-16 11:10:25.906619"], ["id", 14]]

    task = Task.find(params[:id])
    task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 2]]

  def search
    @tasks = Task.search(params[:q])
---
SELECT "tasks".* FROM "tasks" WHERE (name LIKE '%task%' OR description LIKE '%task%') ORDER BY number