app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "limit", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "タスク"], ["description", "タスク"], ["created_at", "2019-08-04 21:15:27.421429"], ["updated_at", "2019-08-04 21:15:27.421429"], ["limit", "2019-08-04"], ["status", 1]]

  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)
---
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", ""], ["updated_at", "2019-08-03 10:02:21.970633"], ["id", 8]]

    task = Task.find(params[:id])
    task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 2]]