app/models/user.rb

  def confirm_none_admin_user
    if User.where(admin: true).count == 1
---
SELECT COUNT(*) FROM "users" WHERE "users"."admin" = $1  [["admin", true]]