app/views/admin/users/index.html.slim

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" IN ($1, $2, $3, $4)  [["user_id", 1], ["user_id", 2], ["user_id", 5], ["user_id", 11]]
---
  tbody
    - @users.preload(:tasks).each do |user|

SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 1]]
---
        td= user.admin? ? 'あり' : 'なし'
        td= user.tasks.count